tap "1password/tap"
tap "arl/arl"
tap "homebrew/bundle"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "joshmedeski/sesh"
tap "koekeishiya/formulae"
tap "noahgorstein/tap"
tap "noborus/tap"
tap "stevedylandev/snippets-cli"
tap "tinted-theming/tinted"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Core application library for C
brew "glib"
# Statistics utility to count lines of code
brew "cloc"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generic machine emulator and virtualizer
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# More intuitive version of du in rust
brew "dust"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# GNU grep, egrep and fgrep
brew "grep"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Tool for glamorous shell scripts
brew "gum"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Uses CSS selectors to extract bits content from HTML files
brew "htmlq"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Trigger notifications when a process completes
brew "noti"
# Libraries for security-enabled client and server applications
brew "nss"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Command-line tool to view objects (JSON/YAML/TOML) in TUI tree widget
brew "otree"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Perl compatible regular expressions library
brew "pcre"
# General-purpose scripting language
brew "php"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Perform tasks asynchronously without external tools
brew "zsh-async"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Python version management
brew "pyenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line tool to batch rename files and directories
brew "rnr"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Nodejs-based tool for optimizing SVG vector graphics files
brew "svgo"
# Tool Command Language
brew "tcl-tk"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Smart terminal session manager
brew "joshmedeski/sesh/sesh"
# a TUI playground to experiment and play with jq
brew "noahgorstein/tap/jqp"
# Feature rich terminal pager
brew "noborus/tap/ov"
# Clean and simple code sharing
brew "stevedylandev/snippets-cli/snippets-cli"
# Change the theme of your terminal, text editor and anything else with one command.
brew "tinted-theming/tinted/tinty"
# Command-line interface for 1Password
cask "1password-cli"
cask "font-symbols-only-nerd-font"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Modified browser that helps in responsive web development
cask "responsively"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
