tap "1password/tap"
tap "arl/arl"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "joshmedeski/sesh"
tap "koekeishiya/formulae"
tap "noahgorstein/tap"
tap "noborus/tap"
tap "tinted-theming/tinted"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "libssh2"
brew "bat"
brew "cloc"
brew "libidn2"
brew "unbound"
brew "gnutls"
brew "pcre"
brew "qemu"
brew "lima"
brew "colima"
brew "curl"
brew "diff-so-fancy"
brew "difftastic"
brew "direnv"
brew "docker"
brew "docker-credential-helper"
brew "dust"
brew "fd"
brew "openjpeg"
brew "ffmpegthumbnailer"
brew "fish"
brew "fnm"
brew "freetds"
brew "fx"
brew "fzf"
brew "gd"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "guile"
brew "gum"
brew "lua"
brew "highlight"
brew "htmlq"
brew "htop"
brew "httpie"
brew "hurl"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jless"
brew "jq"
brew "krb5"
brew "lazygit"
brew "lsd"
brew "miller"
brew "noti"
brew "nss"
brew "pandoc"
brew "php"
brew "pnpm"
brew "poppler"
brew "zsh-async"
brew "pure"
brew "python@3.11"
brew "python@3.9"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rnr"
brew "stow"
brew "tealdeer"
brew "tmux"
brew "trash"
brew "tree"
brew "unar"
brew "wdiff"
brew "wget"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh"
brew "arl/arl/gitmux"
brew "jesseduffield/lazydocker/lazydocker"
brew "joshmedeski/sesh/sesh"
brew "noahgorstein/tap/jqp"
brew "noborus/tap/ov"
brew "tinted-theming/tinted/tinty"
cask "1password-cli"
cask "alacritty"
cask "font-symbols-only-nerd-font"
cask "notunes"
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "abusaidm.html-snippets"
vscode "astro-build.astro-vscode"
vscode "awesomektvn.toggle-semicolon"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "chintans98.markdown-jira"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cssho.vscode-svgviewer"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-quick-select"
vscode "dcortes92.freemarker"
vscode "dkundel.vscode-npm-source"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "earshinov.permute-lines"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fabianlauer.vs-code-xml-format"
vscode "formulahendry.auto-rename-tag"
vscode "gamunu.vscode-yarn"
vscode "ghmcadams.lintlens"
vscode "htmlhint.vscode-htmlhint"
vscode "hwencc.html-tag-wrapper"
vscode "idered.npm"
vscode "jeffersonlicet.snipped"
vscode "jkjustjoshing.vscode-text-pastry"
vscode "jsynowiec.vscode-insertdatestring"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "mfeckies.handlebars-formatter"
vscode "mitchdenny.ecdc"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-scss"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-typescript-tslint-plugin"
vscode "pkief.material-icon-theme"
vscode "rintoj.json-organizer"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "sdras.night-owl"
vscode "steoates.autoimport"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "tabnine.tabnine-vscode"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.vscode-input-sequence"
vscode "vscode-icons-team.vscode-icons"
vscode "wallabyjs.console-ninja"
vscode "wmaurer.change-case"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "zignd.html-css-class-completion"
